In [58]:
import pandas as pd
data = pd.read_csv("student_scores.csv")
data.head(10)

     name  hours  score gender grades class
0   Aarav    NaN   76.0      M      A    9A
1    Riya    5.0   62.0      F      B    9B
2   Kabir   10.0    NaN      M      A   10A
3    Sana    4.0   55.0      F      C    9A
4  Vivaan    7.0   72.0      M      B   10B
5  Ishita    6.0   64.0      F      B    9C
6   Rohan    3.0   48.0      M      D    9B
7   Meera    9.0   90.0      F      A   11A
8  Aditya    2.0   38.0      M      F    9C
9   Kavya   11.0   93.0      F      A   12A

In [59]:
print('Columns: ', data.columns.tolist())
print('\nInfo:')
print(data.info())
print('\nDescribe:')
print (data.shape)
display(data.describe())

Columns:  ['name', 'hours', 'score', 'gender', 'grades', 'class']

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    92 non-null     object
 1   hours   91 non-null     float64
 2   score   91 non-null     float64
 3   gender  92 non-null     object
 4   grades  92 non-null     object
 5   class   92 non-null     object
dtypes: float64(2), object(4)
memory usage: 4.4+ KB
None

Describe:
(92, 6)

           hours      score
count  91.000000  91.000000
mean    6.494505  68.626374
std     2.272412  15.647966
min     2.000000  35.000000
25%     5.000000  57.000000
50%     7.000000  70.000000
75%     8.000000  81.500000
max    11.000000  94.000000

# Handling Missing Values

In [60]:
print(data.isnull().sum())
data["score"] = data["score"].fillna(data["score"].mean())
#data = data.dropna()

name      0
hours     1
score     1
gender    0
grades    0
class     0
dtype: int64

In [61]:
print(data)

       name  hours      score gender grades class
0     Aarav    NaN  76.000000      M      A    9A
1      Riya    5.0  62.000000      F      B    9B
2     Kabir   10.0  68.626374      M      A   10A
3      Sana    4.0  55.000000      F      C    9A
4    Vivaan    7.0  72.000000      M      B   10B
..      ...    ...        ...    ...    ...   ...
87   Prisha    4.0  52.000000      F      C    9A
88     Neil   10.0  88.000000      M      A   12C
89    Rutvi    7.0  73.000000      F      B   10A
90  Harshit    5.0  57.000000      M      C    9B
91   Vritti    8.0  81.000000      F      A   11B

[92 rows x 6 columns]

In [62]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
#data["gender"] = le.fit_transform(data["gender"])
print(data.head(20))

       name  hours      score gender grades class
0     Aarav    NaN  76.000000      M      A    9A
1      Riya    5.0  62.000000      F      B    9B
2     Kabir   10.0  68.626374      M      A   10A
3      Sana    4.0  55.000000      F      C    9A
4    Vivaan    7.0  72.000000      M      B   10B
5    Ishita    6.0  64.000000      F      B    9C
6     Rohan    3.0  48.000000      M      D    9B
7     Meera    9.0  90.000000      F      A   11A
8    Aditya    2.0  38.000000      M      F    9C
9     Kavya   11.0  93.000000      F      A   12A
10    Naman    5.0  60.000000      M      B   10A
11   Jhanvi    7.0  70.000000      F      B   11B
12   Pranav    4.0  52.000000      M      C    9A
13     Tara    9.0  85.000000      F      A   12B
14     Yash    6.0  66.000000      M      B   10C
15    Anaya    8.0  78.000000      F      A   11A
16    Harsh    3.0  45.000000      M      D    9A
17     Diya   10.0  89.000000      F      A   12C
18  Sarthak    6.0  63.000000      M      B   10B
19    Manya    7.0  74.000000      F      B   11B

In [63]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
#data["gender"] = le.fit_transform(data["gender"])
data["gender"] = data["gender"].map({"M":1,'F':0})
print(data.head(20))

       name  hours      score  gender grades class
0     Aarav    NaN  76.000000       1      A    9A
1      Riya    5.0  62.000000       0      B    9B
2     Kabir   10.0  68.626374       1      A   10A
3      Sana    4.0  55.000000       0      C    9A
4    Vivaan    7.0  72.000000       1      B   10B
5    Ishita    6.0  64.000000       0      B    9C
6     Rohan    3.0  48.000000       1      D    9B
7     Meera    9.0  90.000000       0      A   11A
8    Aditya    2.0  38.000000       1      F    9C
9     Kavya   11.0  93.000000       0      A   12A
10    Naman    5.0  60.000000       1      B   10A
11   Jhanvi    7.0  70.000000       0      B   11B
12   Pranav    4.0  52.000000       1      C    9A
13     Tara    9.0  85.000000       0      A   12B
14     Yash    6.0  66.000000       1      B   10C
15    Anaya    8.0  78.000000       0      A   11A
16    Harsh    3.0  45.000000       1      D    9A
17     Diya   10.0  89.000000       0      A   12C
18  Sarthak    6.0  63.000000       1      B   10B
19    Manya    7.0  74.000000       0      B   11B

In [64]:
le = LabelEncoder()
data["class_encoded"] = le.fit_transform(data["grades"])

In [65]:
x = data[["hours","class_encoded"]]
y = data["score"]

In [66]:
print(data)

       name  hours      score  gender grades class  class_encoded
0     Aarav    NaN  76.000000       1      A    9A              0
1      Riya    5.0  62.000000       0      B    9B              1
2     Kabir   10.0  68.626374       1      A   10A              0
3      Sana    4.0  55.000000       0      C    9A              2
4    Vivaan    7.0  72.000000       1      B   10B              1
..      ...    ...        ...     ...    ...   ...            ...
87   Prisha    4.0  52.000000       0      C    9A              2
88     Neil   10.0  88.000000       1      A   12C              0
89    Rutvi    7.0  73.000000       0      B   10A              1
90  Harshit    5.0  57.000000       1      C    9B              2
91   Vritti    8.0  81.000000       0      A   11B              0

[92 rows x 7 columns]

In [68]:
print(x,y)

    hours  class_encoded
0     NaN              0
1     5.0              1
2    10.0              0
3     4.0              2
4     7.0              1
..    ...            ...
87    4.0              2
88   10.0              0
89    7.0              1
90    5.0              2
91    8.0              0

[92 rows x 2 columns] 0     76.000000
1     62.000000
2     68.626374
3     55.000000
4     72.000000
        ...
87    52.000000
88    88.000000
89    73.000000
90    57.000000
91    81.000000
Name: score, Length: 92, dtype: float64